# Написать точно такую же процедуру, но в декларативном стиле

def sort_list_declarative(numbers):
    numbers.sort(reverse=True)


lst = [7, 2, 9, 1, 7, 0]
sort_list_declarative(lst)
print()